dderg/serval/src/stm32/phase_stepping_spi.c
#include "autoconf.h"
#include "phase_stepping_spi.h"
#include "gpio.h"
#include "command.h"
#include "board/irq.h"
#include "board/misc.h"
#include "internal.h"
#if CONFIG_MACH_STM32H7
#include "board/armcm_boot.h"
#include "generic/motion_nvic_prio.h"
#endif

#define MAX_PHASE_BUSES   4
#define MAX_PHASE_MOTORS  16   // must match Rust state::MAX_STEPPER_OIDS
#define XDIRECT_LEN       5
#define PHASE_TXBUF_STRIDE 96
#define PHASE_FG_BOUNCE   32   // foreground DMA scratch; one cache line, holds a
                               // 5-byte TMC datagram. Longer transfers fall back
                               // to PIO (never issued during phase stepping).
_Static_assert(PHASE_TXBUF_STRIDE % 32 == 0,
               "half-buffer must be 32-byte (cache-line) aligned: "
               "SCB_CleanDCache_by_Addr granularity is one 32-byte line");
_Static_assert(PHASE_TXBUF_STRIDE >= MAX_PHASE_MOTORS * XDIRECT_LEN,
               "half-buffer too small to hold every motor's datagram");

#define PHASE_FAULT_TEIF 0x01u
#define PHASE_FAULT_FEIF 0x02u
#define PHASE_FAULT_EOT  0x04u

// Packed into the free upper bits [31:16] of the commit status word; Rust
// decodes only [15:0] (bus<<8|kind), so these reach the logged fault_detail.
#define PHASE_DIAG_CURSOR_SHIFT 16          // bits 19:16 = cursor at fault
#define PHASE_DIAG_NDTR_SHIFT   20          // bits 23:20 = DMA bytes still pending
#define PHASE_DIAG_TCIF_BIT     (1u << 24)  // DMA TCIF latched (transfer done)
#define PHASE_DIAG_TCRAN_BIT    (1u << 25)  // TC ISR has executed at least once
#define PHASE_DIAG_FGSTUCK_BIT  (1u << 26)  // overrun source = foreground holder
#define PHASE_DIAG_SPE_BIT      (1u << 27)  // SPI SPE set (peripheral enabled)
#define PHASE_DIAG_TXP_BIT      (1u << 28)  // SPI TXP (tx fifo has space)
#define PHASE_DIAG_DMAEN_BIT    (1u << 29)  // DMA stream still enabled
#define PHASE_DIAG_SUSP_BIT     (1u << 30)  // SPI master suspended (clock stalled)
#define PHASE_DIAG_EOT_BIT      (1u << 31)  // SPI EOT set (transfer ended)

enum { PHASE_OWNER_NONE = 0, PHASE_OWNER_PHASE = 1, PHASE_OWNER_FG = 2 };

struct phase_bus_state {
    struct spi_config cfg;
    struct spi_config fast_cfg;
    uint8_t configured;

    uint8_t seq[MAX_PHASE_MOTORS];
    uint8_t seq_len;

#if CONFIG_MACH_STM32H7
    __attribute__((aligned(32))) uint8_t txbuf[2][PHASE_TXBUF_STRIDE];
    __attribute__((aligned(32))) uint8_t fg_txbuf[PHASE_FG_BOUNCE];
    __attribute__((aligned(32))) uint8_t fg_rxbuf[PHASE_FG_BOUNCE];
    volatile uint8_t busy;
    volatile uint8_t owner;
    volatile uint8_t sticky_fault;
    volatile uint8_t fg_dirty;
    uint8_t active_half;
    uint8_t commit_half;
    uint8_t cursor;
    uint8_t fg_defer_count;

    DMA_Stream_TypeDef *stream;
    DMAMUX_Channel_TypeDef *mux;
    volatile uint32_t *isr_reg;
    volatile uint32_t *ifcr_reg;
    uint32_t tcif, teif, feif, flag_clear;
    IRQn_Type irqn;

    DMA_Stream_TypeDef *rx_stream;
    DMAMUX_Channel_TypeDef *rx_mux;
    volatile uint32_t *rx_isr_reg;
    volatile uint32_t *rx_ifcr_reg;
    uint32_t rx_tcif, rx_teif, rx_feif, rx_flag_clear;
#endif
};

struct phase_motor_state {
    struct gpio_out cs;
    uint8_t bus_id;
    uint8_t configured;
};

#if CONFIG_MACH_STM32H7
// DMA1/2 cannot reach DTCM (0x20000000); the TX double-buffer must live in
// DMA-reachable AXI SRAM. Budget is asserted here and summed in runtime_storage.c.
__attribute__((section(".axi_bss")))
#endif
static struct phase_bus_state  phase_buses[MAX_PHASE_BUSES];
static struct phase_motor_state phase_motors[MAX_PHASE_MOTORS];

#if CONFIG_MACH_STM32H7
_Static_assert(sizeof(phase_buses) <= 2048,
               "phase_buses exceeds its .axi_bss budget — raise "
               "AXI_BSS_PHASE_BUSES_BYTES in runtime_storage.c to match");
#endif

static volatile uint32_t phase_defer_count = 0;
static volatile uint32_t phase_write_count = 0;
static volatile uint8_t  phase_spi_writes_enabled = 0;

__attribute__((used, externally_visible))
uint32_t
phase_spi_get_skip_count(void)
{
    return phase_defer_count;
}

__attribute__((used, externally_visible))
uint32_t
phase_spi_get_write_count(void)
{
    return phase_write_count;
}

__attribute__((used, externally_visible))
void
phase_stepping_enable_writes(void)
{
    phase_spi_writes_enabled = 1;
}

__attribute__((used, externally_visible))
void
phase_stepping_disable_writes(void)
{
    phase_spi_writes_enabled = 0;
}

static void
phase_pack_datagram(uint8_t *dst, int16_t coil_a, int16_t coil_b)
{
    uint16_t ua = (uint16_t)coil_a;
    uint16_t ub = (uint16_t)coil_b;
    dst[0] = 0xAD;
    dst[1] = (uint8_t)((ub >> 8) & 0x01);
    dst[2] = (uint8_t)(ub & 0xFF);
    dst[3] = (uint8_t)((ua >> 8) & 0x01);
    dst[4] = (uint8_t)(ua & 0xFF);
}

#if CONFIG_MACH_STM32H7

// DMAMUX1 request-line IDs for each SPI peripheral's TX channel (RM0433 Tbl.
// "DMAMUX1: assignment of multiplexer inputs to resources").
#define SPI1_TX_DMAMUX_REQ 38
#define SPI2_TX_DMAMUX_REQ 40
#define SPI3_TX_DMAMUX_REQ 62
#define SPI4_TX_DMAMUX_REQ 84
#define SPI5_TX_DMAMUX_REQ 86

// Each SPI's RX request line sits one below its TX line in the DMAMUX1 table.
#define SPI1_RX_DMAMUX_REQ 37
#define SPI2_RX_DMAMUX_REQ 39
#define SPI3_RX_DMAMUX_REQ 61
#define SPI4_RX_DMAMUX_REQ 83
#define SPI5_RX_DMAMUX_REQ 85

struct dma_assign {
    DMA_Stream_TypeDef *stream;
    DMAMUX_Channel_TypeDef *mux;
    IRQn_Type irqn;
    uint32_t tcif, teif, feif, clear;
};

static const struct dma_assign dma_table[MAX_PHASE_BUSES] = {
    { DMA1_Stream0, DMAMUX1_Channel0, DMA1_Stream0_IRQn, DMA_LISR_TCIF0,
      DMA_LISR_TEIF0, DMA_LISR_FEIF0, DMA_LIFCR_CTCIF0 | DMA_LIFCR_CHTIF0
      | DMA_LIFCR_CTEIF0 | DMA_LIFCR_CDMEIF0 | DMA_LIFCR_CFEIF0 },
    { DMA1_Stream1, DMAMUX1_Channel1, DMA1_Stream1_IRQn, DMA_LISR_TCIF1,
      DMA_LISR_TEIF1, DMA_LISR_FEIF1, DMA_LIFCR_CTCIF1 | DMA_LIFCR_CHTIF1
      | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CFEIF1 },
    { DMA1_Stream2, DMAMUX1_Channel2, DMA1_Stream2_IRQn, DMA_LISR_TCIF2,
      DMA_LISR_TEIF2, DMA_LISR_FEIF2, DMA_LIFCR_CTCIF2 | DMA_LIFCR_CHTIF2
      | DMA_LIFCR_CTEIF2 | DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CFEIF2 },
    { DMA1_Stream3, DMAMUX1_Channel3, DMA1_Stream3_IRQn, DMA_LISR_TCIF3,
      DMA_LISR_TEIF3, DMA_LISR_FEIF3, DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3
      | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CFEIF3 },
};

// RX streams for foreground full-duplex reads. Foreground polls completion, so
// these carry no IRQ wiring. Streams 4-7 report status in the high half (HISR/
// HIFCR); the phase TX streams 0-3 use the low half.
static const struct dma_assign rx_dma_table[MAX_PHASE_BUSES] = {
    { DMA1_Stream4, DMAMUX1_Channel4, DMA1_Stream4_IRQn, DMA_HISR_TCIF4,
      DMA_HISR_TEIF4, DMA_HISR_FEIF4, DMA_HIFCR_CTCIF4 | DMA_HIFCR_CHTIF4
      | DMA_HIFCR_CTEIF4 | DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CFEIF4 },
    { DMA1_Stream5, DMAMUX1_Channel5, DMA1_Stream5_IRQn, DMA_HISR_TCIF5,
      DMA_HISR_TEIF5, DMA_HISR_FEIF5, DMA_HIFCR_CTCIF5 | DMA_HIFCR_CHTIF5
      | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CFEIF5 },
    { DMA1_Stream6, DMAMUX1_Channel6, DMA1_Stream6_IRQn, DMA_HISR_TCIF6,
      DMA_HISR_TEIF6, DMA_HISR_FEIF6, DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6
      | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6 },
    { DMA1_Stream7, DMAMUX1_Channel7, DMA1_Stream7_IRQn, DMA_HISR_TCIF7,
      DMA_HISR_TEIF7, DMA_HISR_FEIF7, DMA_HIFCR_CTCIF7 | DMA_HIFCR_CHTIF7
      | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CFEIF7 },
};

static uint8_t
phase_spi_tx_request(SPI_TypeDef *spi)
{
    if (spi == SPI1)
        return SPI1_TX_DMAMUX_REQ;
    if (spi == SPI2)
        return SPI2_TX_DMAMUX_REQ;
#ifdef SPI3
    if (spi == SPI3)
        return SPI3_TX_DMAMUX_REQ;
#endif
#ifdef SPI4
    if (spi == SPI4)
        return SPI4_TX_DMAMUX_REQ;
#endif
#ifdef SPI5
    if (spi == SPI5)
        return SPI5_TX_DMAMUX_REQ;
#endif
    shutdown("phase DMA: SPI peripheral not on DMAMUX1 (use spi1..5)");
}

static uint8_t
phase_spi_rx_request(SPI_TypeDef *spi)
{
    if (spi == SPI1)
        return SPI1_RX_DMAMUX_REQ;
    if (spi == SPI2)
        return SPI2_RX_DMAMUX_REQ;
#ifdef SPI3
    if (spi == SPI3)
        return SPI3_RX_DMAMUX_REQ;
#endif
#ifdef SPI4
    if (spi == SPI4)
        return SPI4_RX_DMAMUX_REQ;
#endif
#ifdef SPI5
    if (spi == SPI5)
        return SPI5_RX_DMAMUX_REQ;
#endif
    shutdown("phase DMA: SPI peripheral not on DMAMUX1 (use spi1..5)");
}

static volatile uint32_t phase_tc_count;

static void phase_dma_tc_isr(uint8_t bus_id);

