dderg/serval/src/stm32/phase_stepping_spi.c
void phase_dma_s0_irq(void) { phase_dma_tc_isr(0); }
void phase_dma_s1_irq(void) { phase_dma_tc_isr(1); }
void phase_dma_s2_irq(void) { phase_dma_tc_isr(2); }
void phase_dma_s3_irq(void) { phase_dma_tc_isr(3); }

static void
phase_dma_init_bus(uint8_t bus_id)
{
    struct phase_bus_state *bus = &phase_buses[bus_id];
    const struct dma_assign *a = &dma_table[bus_id];

    RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;
    (void)RCC->AHB1ENR;

    bus->stream = a->stream;
    bus->mux = a->mux;
    bus->isr_reg = &DMA1->LISR;
    bus->ifcr_reg = &DMA1->LIFCR;
    bus->tcif = a->tcif;
    bus->teif = a->teif;
    bus->feif = a->feif;
    bus->flag_clear = a->clear;
    bus->irqn = a->irqn;

    bus->stream->CR = 0;
    while (bus->stream->CR & DMA_SxCR_EN)
        ;
    *bus->ifcr_reg = bus->flag_clear;
    bus->mux->CCR = phase_spi_tx_request(bus->cfg.spi);

    const struct dma_assign *r = &rx_dma_table[bus_id];
    bus->rx_stream = r->stream;
    bus->rx_mux = r->mux;
    bus->rx_isr_reg = &DMA1->HISR;
    bus->rx_ifcr_reg = &DMA1->HIFCR;
    bus->rx_tcif = r->tcif;
    bus->rx_teif = r->teif;
    bus->rx_feif = r->feif;
    bus->rx_flag_clear = r->clear;

    bus->rx_stream->CR = 0;
    while (bus->rx_stream->CR & DMA_SxCR_EN)
        ;
    *bus->rx_ifcr_reg = bus->rx_flag_clear;
    bus->rx_mux->CCR = phase_spi_rx_request(bus->cfg.spi);

    switch (bus_id) {
    case 0:
        armcm_enable_irq(phase_dma_s0_irq, DMA1_Stream0_IRQn, MOTION_NVIC_PRIO);
        break;
    case 1:
        armcm_enable_irq(phase_dma_s1_irq, DMA1_Stream1_IRQn, MOTION_NVIC_PRIO);
        break;
    case 2:
        armcm_enable_irq(phase_dma_s2_irq, DMA1_Stream2_IRQn, MOTION_NVIC_PRIO);
        break;
    case 3:
        armcm_enable_irq(phase_dma_s3_irq, DMA1_Stream3_IRQn, MOTION_NVIC_PRIO);
        break;
    default:
        break;
    }
}

static void
phase_dma_arm_motor(struct phase_bus_state *bus)
{
    uint8_t midx = bus->seq[bus->cursor];
    struct spi_config fast = bus->fast_cfg;
    SPI_TypeDef *spi = fast.spi;

    spi->CR1 = SPI_CR1_SSI; // CFG1/CFG2 are write-protected while SPE=1
    spi->CFG1 = ((uint32_t)fast.div << SPI_CFG1_MBR_Pos)
              | (7u << SPI_CFG1_DSIZE_Pos) | SPI_CFG1_TXDMAEN;
    // COMM_0 = simplex transmitter: XDIRECT is write-only, so suppress RX. In
    // full-duplex the master also gates its clock on RX-fifo space and every
    // frame loads an undrained RX fifo — the source of the TX/DMA desync.
    spi->CFG2 = ((uint32_t)fast.mode << SPI_CFG2_CPHA_Pos)
              | SPI_CFG2_COMM_0
              | SPI_CFG2_MASTER | SPI_CFG2_SSM | SPI_CFG2_AFCNTR
              | SPI_CFG2_SSOE;

    DMA_Stream_TypeDef *st = bus->stream;
    st->CR &= ~DMA_SxCR_EN;
    while (st->CR & DMA_SxCR_EN)
        ;
    st->FCR = 0; // direct mode, no FIFO-error interrupt — not the reset 0x21
    *bus->ifcr_reg = bus->flag_clear;
    st->PAR = (uint32_t)(uintptr_t)&spi->TXDR;
    st->M0AR = (uint32_t)(uintptr_t)&bus->txbuf[bus->commit_half][midx * XDIRECT_LEN];
    st->NDTR = XDIRECT_LEN;
    st->CR = DMA_SxCR_DIR_0 | DMA_SxCR_MINC | DMA_SxCR_TCIE | DMA_SxCR_TEIE;
    st->CR |= DMA_SxCR_EN;

    gpio_out_write(phase_motors[midx].cs, 0);

    spi->CR2 = (uint32_t)XDIRECT_LEN << SPI_CR2_TSIZE_Pos;
    spi->CR1 = SPI_CR1_SSI | SPI_CR1_SPE;
    // Clear stale EOT/SUSP only after SPE=1 — while the peripheral is disabled
    // the clear does not take, so a CSTART onto a leftover suspend (from a
    // foreground transfer or a torn-down batch) starts already-ended and raises
    // no TX-DMA request, freezing NDTR at full.
    spi->IFCR = 0xFFFFFFFF;
    spi->CR1 = SPI_CR1_SSI | SPI_CR1_CSTART | SPI_CR1_SPE;
}

static void
phase_dma_release_current(struct phase_bus_state *bus)
{
    bus->stream->CR &= ~DMA_SxCR_EN;
    *bus->ifcr_reg = bus->flag_clear;
    SPI_TypeDef *spi = bus->fast_cfg.spi;
    spi->IFCR = 0xFFFFFFFF;
    spi->CR1 = SPI_CR1_SSI;
    gpio_out_write(phase_motors[bus->seq[bus->cursor]].cs, 1);
    bus->busy = 0;
    bus->owner = PHASE_OWNER_NONE;
}

static void
phase_dma_tc_isr(uint8_t bus_id)
{
    phase_tc_count++;
    struct phase_bus_state *bus = &phase_buses[bus_id];
    uint32_t isr = *bus->isr_reg;
    *bus->ifcr_reg = bus->flag_clear;

    uint8_t err = 0;
    if (isr & bus->teif) {
        bus->sticky_fault |= PHASE_FAULT_TEIF;
        err = 1;
    }
    if (isr & bus->feif) {
        bus->sticky_fault |= PHASE_FAULT_FEIF;
        err = 1;
    }

    bus->stream->CR &= ~DMA_SxCR_EN;

    // TC = TX FIFO fed, not last byte shifted out; gate CS-high on EOT.
    SPI_TypeDef *spi = bus->fast_cfg.spi;
    if (!err) {
        uint32_t deadline = timer_read_time() + timer_from_us(50);
        while (!(spi->SR & SPI_SR_EOT)) {
            if (!timer_is_before(timer_read_time(), deadline)) {
                bus->sticky_fault |= PHASE_FAULT_EOT;
                err = 1;
                break;
            }
        }
    }

    spi->IFCR = 0xFFFFFFFF;
    spi->CR1 = SPI_CR1_SSI;
    gpio_out_write(phase_motors[bus->seq[bus->cursor]].cs, 1);

    if (err) {
        // Stop the walk: do not clock more motors onto faulted HW. The sticky
        // bit surfaces a loud fault at the next commit tick.
        bus->busy = 0;
        bus->owner = PHASE_OWNER_NONE;
        return;
    }

    bus->cursor++;
    if (bus->cursor < bus->seq_len) {
        phase_dma_arm_motor(bus);
    } else {
        bus->busy = 0;
        bus->owner = PHASE_OWNER_NONE;
        phase_write_count++;
    }
}

static int
phase_bus_for_spi(SPI_TypeDef *spi)
{
    for (int b = 0; b < MAX_PHASE_BUSES; b++)
        if (phase_buses[b].configured && phase_buses[b].cfg.spi == spi)
            return b;
    return -1;
}

int
phase_spi_fg_begin(struct spi_config config)
{
    int b = phase_bus_for_spi(config.spi);
    if (b < 0)
        return -1;
    struct phase_bus_state *bus = &phase_buses[b];
    uint32_t deadline = timer_read_time() + timer_from_us(500);
    for (;;) {
        while (bus->busy) {
            if (!timer_is_before(timer_read_time(), deadline))
                shutdown("phase bus stuck: foreground SPI could not claim the "
                         "bus (phase DMA batch never drained)");
        }
        irqstatus_t flag = irq_save();
        if (!bus->busy) {
            bus->busy = 1;
            bus->owner = PHASE_OWNER_FG;
            irq_restore(flag);
            return b;
        }
        irq_restore(flag);
    }
}

void
phase_spi_fg_end(int bus_token)
{
    if (bus_token < 0)
        return;
    phase_buses[bus_token].fg_dirty = 1;
    phase_buses[bus_token].busy = 0;
    phase_buses[bus_token].owner = PHASE_OWNER_NONE;
}

// Foreground TMC register access on a phase-managed bus, driven by full-duplex
// DMA instead of PIO so no programmed-IO transfer ever shares the spi1 bus with
// the phase batch. Synchronous: claims the bus (phase commit defers while held),
// runs one transfer, and blocks on RX-DMA completion — RX-TC fires only once
// every frame is fully shifted in, so it doubles as the true end-of-transfer.
// Returns 0 on success, -1 when the SPI is not a phase bus or the length
// exceeds the bounce (caller then falls back to the PIO path).
int
phase_spi_fg_dma_transfer(struct spi_config config, uint8_t receive_data,
                          uint8_t len, uint8_t *data)
{
    int b = phase_bus_for_spi(config.spi);
    if (b < 0 || len > PHASE_FG_BOUNCE)
        return -1;
    struct phase_bus_state *bus = &phase_buses[b];
    SPI_TypeDef *spi = config.spi;

    uint32_t claim_deadline = timer_read_time() + timer_from_us(500);
    for (;;) {
        while (bus->busy) {
            if (!timer_is_before(timer_read_time(), claim_deadline))
                shutdown("phase bus stuck: foreground DMA could not claim the "
                         "bus (phase batch never drained)");
        }
        irqstatus_t flag = irq_save();
        if (!bus->busy) {
            bus->busy = 1;
            bus->owner = PHASE_OWNER_FG;
            irq_restore(flag);
            break;
        }
        irq_restore(flag);
    }

