dderg/serval/src/stm32/phase_stepping_spi.c
    for (uint8_t i = 0; i < len; i++)
        bus->fg_txbuf[i] = data[i];
    SCB_CleanDCache_by_Addr((void *)bus->fg_txbuf, (int32_t)PHASE_FG_BOUNCE);
    SCB_InvalidateDCache_by_Addr((void *)bus->fg_rxbuf, (int32_t)PHASE_FG_BOUNCE);

    spi->CR1 = SPI_CR1_SSI;
    spi->CFG1 = ((uint32_t)config.div << SPI_CFG1_MBR_Pos)
              | (7u << SPI_CFG1_DSIZE_Pos)
              | SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN;
    spi->CFG2 = ((uint32_t)config.mode << SPI_CFG2_CPHA_Pos)
              | SPI_CFG2_MASTER | SPI_CFG2_SSM | SPI_CFG2_AFCNTR | SPI_CFG2_SSOE;

    DMA_Stream_TypeDef *tx = bus->stream;
    DMA_Stream_TypeDef *rx = bus->rx_stream;
    tx->CR &= ~DMA_SxCR_EN;
    while (tx->CR & DMA_SxCR_EN)
        ;
    rx->CR &= ~DMA_SxCR_EN;
    while (rx->CR & DMA_SxCR_EN)
        ;
    tx->FCR = 0;
    rx->FCR = 0;
    *bus->ifcr_reg = bus->flag_clear;
    *bus->rx_ifcr_reg = bus->rx_flag_clear;

    // No TCIE/TEIE: the phase TX stream (0-3) has the phase TC ISR wired, so an
    // enabled interrupt here would fire it with owner==FG. Foreground polls.
    rx->PAR = (uint32_t)(uintptr_t)&spi->RXDR;
    rx->M0AR = (uint32_t)(uintptr_t)bus->fg_rxbuf;
    rx->NDTR = len;
    rx->CR = DMA_SxCR_MINC;
    tx->PAR = (uint32_t)(uintptr_t)&spi->TXDR;
    tx->M0AR = (uint32_t)(uintptr_t)bus->fg_txbuf;
    tx->NDTR = len;
    tx->CR = DMA_SxCR_DIR_0 | DMA_SxCR_MINC;
    rx->CR |= DMA_SxCR_EN;
    tx->CR |= DMA_SxCR_EN;

    spi->CR2 = (uint32_t)len << SPI_CR2_TSIZE_Pos;
    spi->CR1 = SPI_CR1_SSI | SPI_CR1_SPE;
    spi->IFCR = 0xFFFFFFFF;
    spi->CR1 = SPI_CR1_SSI | SPI_CR1_CSTART | SPI_CR1_SPE;

    uint32_t deadline = timer_read_time() + timer_from_us(100 * (uint32_t)len + 100);
    for (;;) {
        uint32_t rx_isr = *bus->rx_isr_reg;
        if (rx_isr & bus->rx_tcif)
            break;
        if ((rx_isr & (bus->rx_teif | bus->rx_feif))
            || (*bus->isr_reg & bus->teif)) {
            shutdown("phase foreground DMA: SPI bus transfer error");
        }
        if (!timer_is_before(timer_read_time(), deadline))
            shutdown("phase foreground DMA: SPI rx timeout");
    }

    tx->CR &= ~DMA_SxCR_EN;
    rx->CR &= ~DMA_SxCR_EN;
    *bus->ifcr_reg = bus->flag_clear;
    *bus->rx_ifcr_reg = bus->rx_flag_clear;
    spi->IFCR = 0xFFFFFFFF;
    spi->CR1 = SPI_CR1_SSI;

    SCB_InvalidateDCache_by_Addr((void *)bus->fg_rxbuf, PHASE_FG_BOUNCE);
    if (receive_data)
        for (uint8_t i = 0; i < len; i++)
            data[i] = bus->fg_rxbuf[i];

    // The full-duplex read leaves the peripheral in a mode the simplex-transmit
    // phase arm cannot always restart from cleanly; flag the bus so the next
    // batch resets the SPI core before arming.
    bus->fg_dirty = 1;
    bus->busy = 0;
    bus->owner = PHASE_OWNER_NONE;
    return 0;
}

static uint32_t
phase_overrun_diag(struct phase_bus_state *bus, uint32_t isr)
{
    SPI_TypeDef *spi = bus->fast_cfg.spi;
    uint32_t sr = spi->SR;
    DMA_Stream_TypeDef *st = bus->stream;
    return ((uint32_t)(bus->cursor & 0xF) << PHASE_DIAG_CURSOR_SHIFT)
         | ((st->NDTR & 0xF) << PHASE_DIAG_NDTR_SHIFT)
         | ((isr & bus->tcif) ? PHASE_DIAG_TCIF_BIT : 0u)
         | (phase_tc_count ? PHASE_DIAG_TCRAN_BIT : 0u)
         | ((spi->CR1 & SPI_CR1_SPE) ? PHASE_DIAG_SPE_BIT : 0u)
         | ((sr & SPI_SR_TXP) ? PHASE_DIAG_TXP_BIT : 0u)
         | ((st->CR & DMA_SxCR_EN) ? PHASE_DIAG_DMAEN_BIT : 0u)
         | ((sr & SPI_SR_SUSP) ? PHASE_DIAG_SUSP_BIT : 0u)
         | ((sr & SPI_SR_EOT) ? PHASE_DIAG_EOT_BIT : 0u);
}

#endif // CONFIG_MACH_STM32H7

// used,externally_visible: called only from Rust via FFI; without this,
// -fwhole-program LTO DCEs the bodies and the link fails.
__attribute__((used, externally_visible))
void
phase_stepping_register_bus(uint8_t bus_id, struct spi_config cfg)
{
    if (bus_id >= MAX_PHASE_BUSES)
        return;
    phase_buses[bus_id].cfg = cfg;
    struct spi_config fast = cfg;
    uint32_t pclk = get_pclock_frequency((uint32_t)(uintptr_t)cfg.spi);
    uint32_t target_rate = 8000000;
    uint32_t div = 0;
    while ((pclk >> (div + 1)) > target_rate && div < 7)
        div++;
    fast.div = div;
    phase_buses[bus_id].fast_cfg = fast;
    phase_buses[bus_id].seq_len = 0;
    phase_buses[bus_id].configured = 1;
#if CONFIG_MACH_STM32H7
    phase_buses[bus_id].active_half = 0;
    phase_buses[bus_id].busy = 0;
    phase_buses[bus_id].owner = PHASE_OWNER_NONE;
    phase_buses[bus_id].sticky_fault = 0;
    phase_buses[bus_id].fg_dirty = 0;
    phase_buses[bus_id].fg_defer_count = 0;
    phase_dma_init_bus(bus_id);
#endif
}

__attribute__((used, externally_visible))
void
phase_stepping_register_motor(uint8_t motor_idx, uint8_t bus_id,
                              uint8_t cs_pin_id)
{
    if (motor_idx >= MAX_PHASE_MOTORS || bus_id >= MAX_PHASE_BUSES)
        return;
    if (!phase_buses[bus_id].configured)
        return;
    phase_motors[motor_idx].cs = gpio_out_setup(cs_pin_id, 1); // idle high
    phase_motors[motor_idx].bus_id = bus_id;
    phase_motors[motor_idx].configured = 1;

    struct phase_bus_state *bus = &phase_buses[bus_id];
    for (uint8_t i = 0; i < bus->seq_len; i++)
        if (bus->seq[i] == motor_idx)
            return;
    if (bus->seq_len < MAX_PHASE_MOTORS)
        bus->seq[bus->seq_len++] = motor_idx;
}

__attribute__((used, externally_visible))
void
phase_stepping_write_xdirect(uint8_t motor_idx,
                             int16_t coil_a, int16_t coil_b)
{
    if (!phase_spi_writes_enabled)
        return;
    if (motor_idx >= MAX_PHASE_MOTORS || !phase_motors[motor_idx].configured)
        return;
    uint8_t bus_id = phase_motors[motor_idx].bus_id;
    if (bus_id >= MAX_PHASE_BUSES || !phase_buses[bus_id].configured)
        return;

#if CONFIG_MACH_STM32H7
    struct phase_bus_state *bus = &phase_buses[bus_id];
    phase_pack_datagram(&bus->txbuf[bus->active_half][motor_idx * XDIRECT_LEN],
                        coil_a, coil_b);
#else
    uint8_t datagram[XDIRECT_LEN];
    phase_pack_datagram(datagram, coil_a, coil_b);
    spi_prepare(phase_buses[bus_id].fast_cfg);
    gpio_out_write(phase_motors[motor_idx].cs, 0);
    spi_transfer(phase_buses[bus_id].fast_cfg, 0, sizeof(datagram), datagram);
    gpio_out_write(phase_motors[motor_idx].cs, 1);
    phase_write_count++;
#endif
}

__attribute__((used, externally_visible))
uint32_t
phase_stepping_commit_tick(void)
{
#if CONFIG_MACH_STM32H7
    uint32_t result = 0;
    for (uint8_t b = 0; b < MAX_PHASE_BUSES; b++) {
        struct phase_bus_state *bus = &phase_buses[b];
        if (!bus->configured || bus->seq_len == 0)
            continue;

        irqstatus_t flag = irq_save();

        if (bus->busy) {
            if (bus->owner == PHASE_OWNER_PHASE) {
                // Equal-priority TC ISR can be queued behind this tick, so a
                // physically-complete batch still reads busy==1. Final-motor +
                // DMA TCIF latched + SPI EOT set => pending-but-done, not an
                // overrun: finalize inline and re-arm.
                SPI_TypeDef *spi = bus->fast_cfg.spi;
                uint32_t isr = *bus->isr_reg;
                uint8_t on_last = (uint8_t)(bus->cursor + 1) >= bus->seq_len;
                uint8_t hw_done = (isr & bus->tcif)
                                  && !(isr & (bus->teif | bus->feif))
                                  && (spi->SR & SPI_SR_EOT);
                if (on_last && hw_done) {
                    phase_dma_release_current(bus);
                    phase_write_count++;
                    NVIC_ClearPendingIRQ(bus->irqn);
                } else {
                    if (result == 0)
                        result = ((uint32_t)b << 8) | PHASE_DMA_KIND_OVERRUN
                            | phase_overrun_diag(bus, isr);
                    irq_restore(flag);
                    continue;
                }
            } else {
                phase_defer_count++;
                if (++bus->fg_defer_count >= 2 && result == 0)
                    result = ((uint32_t)b << 8) | PHASE_DMA_KIND_OVERRUN
                        | PHASE_DIAG_FGSTUCK_BIT
                        | phase_overrun_diag(bus, *bus->isr_reg);
                irq_restore(flag);
                continue;
            }
        }
        bus->fg_defer_count = 0;

        uint8_t sticky = bus->sticky_fault;
        if (sticky) {
            if (result == 0) {
                if (sticky & (PHASE_FAULT_TEIF | PHASE_FAULT_EOT))
                    result = ((uint32_t)b << 8) | PHASE_DMA_KIND_TEIF;
                else if (sticky & PHASE_FAULT_FEIF)
                    result = ((uint32_t)b << 8) | PHASE_DMA_KIND_FEIF;
                bus->sticky_fault = 0;
            }
            irq_restore(flag);
            continue;
        }

        if (!phase_spi_writes_enabled) {
            irq_restore(flag);
            continue;
        }

        bus->busy = 1;
        bus->owner = PHASE_OWNER_PHASE;

        if (bus->fg_dirty) {
            // A foreground full-duplex read left the SPI core in a mode the
            // simplex-transmit arm cannot reliably restart from. Pulse the
            // peripheral reset so the batch begins from register defaults; the
            // arm reprograms CFG1/CFG2/CR fully. Only fires after foreground
            // touched the bus, so the phase-only path is untouched.
            struct cline cl =
                lookup_clock_line((uint32_t)(uintptr_t)bus->fast_cfg.spi);
            *cl.rst |= cl.bit;
            (void)*cl.rst;
            *cl.rst &= ~cl.bit;
            bus->fg_dirty = 0;
        }

        uint8_t half = bus->active_half;
        bus->active_half ^= 1;
        bus->commit_half = half;
        bus->cursor = 0;
        SCB_CleanDCache_by_Addr((void *)bus->txbuf[half],
                                (int32_t)sizeof(bus->txbuf[half]));
        phase_dma_arm_motor(bus);
        irq_restore(flag);
    }
    return result;
#else
    return 0;
#endif
}
